wegam/STM32F1xWorkSpace/Driver/Components/SCR/ST7789V.C
//#ifdef	ST7789V

/********************************************************************************
***ST7789V LCD屏驱动器
********************************************************************************/
#include "ST7789V.H"
//#include "LCD.H"
#include "STM32_GPIO.H"
#include "STM32_SYSTICK.H"
#include "STM32_PWM.H"

#include "GT32L32M0180.H"

#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间




sST7789VDef	*pST7789V	=	0;		//内部驱动使用，不可删除

#define	ST7789V_CS_HIGH		(pST7789V->HWPort.sCS_PORT->BSRR	= pST7789V->HWPort.sCS_Pin)
#define	ST7789V_CS_LOW		(pST7789V->HWPort.sCS_PORT->BRR		=	pST7789V->HWPort.sCS_Pin)

#define	ST7789V_DC_HIGH		(pST7789V->HWPort.sDC_PORT->BSRR	= pST7789V->HWPort.sDC_Pin)		//RS
#define	ST7789V_DC_LOW		(pST7789V->HWPort.sDC_PORT->BRR		= pST7789V->HWPort.sDC_Pin)		//RS

#define	ST7789V_WR_HIGH		(pST7789V->HWPort.sWR_PORT->BSRR	= pST7789V->HWPort.sWR_Pin)
#define	ST7789V_WR_LOW		(pST7789V->HWPort.sWR_PORT->BRR		= pST7789V->HWPort.sWR_Pin)   //WriteEnable

#define	ST7789V_RD_HIGH		(pST7789V->HWPort.sRD_PORT->BSRR	= pST7789V->HWPort.sRD_Pin)
#define	ST7789V_RD_LOW		(pST7789V->HWPort.sRD_PORT->BRR		= pST7789V->HWPort.sRD_Pin)   //ReadEnable

//#define	ST7789V_RST_HIGH	(pST7789V->Port.sREST_PORT->BSRR	= pST7789V->Port.sREST_Pin)
//#define	ST7789V_RST_LOW		(pST7789V->Port.sREST_PORT->BRR	= pST7789V->Port.sREST_Pin)

//#define	ST7789V_TE_HIGH		(pST7789V->Port.sTE_PORT->BSRR	= pST7789V->Port.sTE_Pin)
//#define	ST7789V_TE_LOW		(pST7789V->Port.sTE_PORT->BRR	= pST7789V->Port.sTE_Pin)

//#define	ST7789V_BL_HIGH		(pST7789V->sBL_PORT->BSRR	= pST7789V->sBL_Pin)
//#define	ST7789V_BL_LOW		(pST7789V->sBL_PORT->BRR	= pST7789V->sBL_Pin)

#define ST7789V_DATABUS_PORT	(pST7789V->HWPort.sDATABUS_PORT)
#define ST7789V_DATABUS_Pin		(pST7789V->HWPort.sDATABUS_Pin)

#define	ST7789VSet(n)	ST7789V_##n##_HIGH
#define	ST7789VCrl(n)	ST7789V_##n##_LOW

#define ST7789V_BL_ON		PWM_OUT((TIM_TypeDef*) TIM2_BASE,PWM_OUTChannel2,1000,10)	//(R61509V_BL_PORT->BSRR = R61509V_BL_PIN)
#define ST7789V_BL_OFF	PWM_OUT((TIM_TypeDef*) TIM2_BASE,PWM_OUTChannel2,1,1000)		//(R61509V_BL_PORT->BRR = R61509V_BL_PIN)



char	ST7789VStringBuffer[256]={0};			//记录format内码
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void ST7789V_Initialize(void*	pInfo)
{
	sST7789VPortDef*	Port	=	NULL;
	if(NULL==	pInfo)
		return;
	pST7789V		=	(sST7789VDef*)pInfo;		//指针指向	

	Port	=	(sST7789VPortDef*)&pST7789V->HWPort;
	
	//==========================GPIO配置
//	GPIO_Configuration_OPP50	(Port->sBL_PORT,				Port->sBL_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sRD_PORT,				Port->sRD_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
//	GPIO_Configuration_OPP50	(Port->sREST_PORT,			Port->sREST_Pin);				//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sDC_PORT,				Port->sDC_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sWR_PORT,				Port->sWR_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sCS_PORT,				Port->sCS_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
//	GPIO_Configuration_OPP50	(Port->sTE_PORT,				Port->sTE_Pin);					//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605
	GPIO_Configuration_OPP50	(Port->sDATABUS_PORT,		Port->sDATABUS_Pin);		//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605

//  pST7789V->Display.PowerOn   = ST7789V_PowerOn;
//  pST7789V->Display.ShowChar  = ST7789V_ShowChar;
//  pST7789V->Display.ShowWord  = ST7789V_ShowWord;
	
	//------------------------------------------旋转角度
	//pST7789V->ST7789VRotate	=	ST7789V_Rotate_90D;
	ST7789V_Clean(pST7789V->ST7789VBColor);	//清除屏幕函数;
	ST7789V_PowerOn();
}
/*******************************************************************************
*函数名		:	LCD_ShowString
*功能描述	:	显示字符串高通字库
*输入			: x,y:起点坐标
						*p:字符串起始地址
						用16字体
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
unsigned int ST7789V_Printf(u16 x,u16 y,u8 font,u16 color,const char *format,...)				//后边的省略号就是可变参数
{ 
	#include	"stdarg.h"		//用于获取不确定个数的参数
	#include	"stdlib.h"		//malloc动态申请内存空间
//		va_list ap; 										//VA_LIST 是在C语言中解决变参问题的一组宏，所在头文件：#include <stdarg.h>,用于获取不确定个数的参数
//		static char string[ 256 ];			//定义数组，
//  	va_start( ap, format );
//		vsprintf( string , format, ap );    
//		va_end( ap );
	
	//char	ST7789VStringBuffer[256]={0};			//记录format内码
	//1)**********获取数据宽度
  u16 InputDataSize=0;
	//3)**********vArgList为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
	va_list vArgList; 
	//5)**********初始化vArgList的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
	va_start(vArgList, format);
	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
	InputDataSize =vsnprintf(ST7789VStringBuffer,InputDataSize,format,vArgList);
	//7)**********结束可变参数的获取
	va_end(vArgList);                                      		
  if((8!=font)&&(12!=font)&&(16!=font)&&(24!=font)&&(32!=font))
  {
    font  = 32;
  }
	ST7789V_ShowString(x,y,font,color,InputDataSize,(unsigned char*)ST7789VStringBuffer);
	return InputDataSize;
}
/*******************************************************************************
*函数名		:	LCD_ShowString
*功能描述	:	显示字符串高通字库
*输入			: x,y:起点坐标
						*p:字符串起始地址
						用16字体
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
unsigned int ST7789V_PrintfBK(u16 x,u16 y,u8 font,u16 BKColor,u16 PenColor,const char *format,...)				//后边的省略号就是可变参数
{ 
	#include	"stdarg.h"		//用于获取不确定个数的参数
	#include	"stdlib.h"		//malloc动态申请内存空间
//		va_list ap; 										//VA_LIST 是在C语言中解决变参问题的一组宏，所在头文件：#include <stdarg.h>,用于获取不确定个数的参数
//		static char string[ 256 ];			//定义数组，
//  	va_start( ap, format );
//		vsprintf( string , format, ap );    
//		va_end( ap );
	
