wegam/STM32F1xWorkSpace/Driver/Components/SCR/ST7789V.C
	//char	ST7789VStringBuffer[256]={0};			//记录format内码
	//1)**********获取数据宽度
  u16 InputDataSize=0;
	//3)**********vArgList为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
	va_list vArgList; 
	//5)**********初始化vArgList的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
	va_start(vArgList, format);
	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
	InputDataSize =vsnprintf(ST7789VStringBuffer,InputDataSize,format,vArgList);
	//7)**********结束可变参数的获取
	va_end(vArgList);                                      		
  if((8!=font)&&(12!=font)&&(16!=font)&&(24!=font)&&(32!=font))
  {
    font  = 32;
  }
	ST7789V_ShowStringBK(x,y,font,BKColor,PenColor,InputDataSize,(unsigned char*)ST7789VStringBuffer);
	return InputDataSize;
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ST7789V_ShowString(
							u16 x,			//x				:起点x坐标
							u16 y,			//y				:起点y坐标
							u8 font,		//font		:字体大小
							u16 PenColor,//字体颜色
							u8 num,			//num			:字节数
							u8 *Buffer	//Buffer	:显示的内容缓存
)		//高通字库测试程序
{
	unsigned short	MaxV=ST7789V_V,MaxH=ST7789V_H;	//边界值
	unsigned char i=0;
	unsigned char CodeBuffer[256]={0};
	switch(pST7789V->ST7789VRotate)
	{
		case ST7789V_Rotate_0D:
			MaxV=ST7789V_V;
			MaxH=ST7789V_H;
		break;
		case ST7789V_Rotate_90D:
			MaxV=ST7789V_H;
			MaxH=ST7789V_V;
		break;
		case ST7789V_Rotate_180D:
			MaxV=ST7789V_V;
			MaxH=ST7789V_H;
		break;
		case ST7789V_Rotate_270D:
			MaxV=ST7789V_H;
			MaxH=ST7789V_V;
		break;
		default:break;		
	}
	for(i=0;i<num;i++)
	{
		unsigned char GetBufferLength	=	0;
		unsigned char dst=Buffer[i];
		unsigned char UnicodeFlag=0;
		unsigned char UnicodeAddr=0;
		//==================================Unicode
		//UnicodeFlag	=	UnicodeCheck(&Buffer[i],num-i);
		
		
		dst=Buffer[i];
		//A=====================双字节--汉字
		if(dst>0x80)
		{
			u16 word=dst<<8;
      
			dst=Buffer[i+1];
			word=word|dst;			
			//A1=====================显示超限换行
      if(x>MaxH-font)
      {
        x=0;
        y+=font;
      }
      //A2=====================显示到屏尾，从原点开始
      if(y>MaxV-font)
      {
        y=x=0;
      }
      //A3=====================读取点阵数据
			GetBufferLength	=	GT32L32_GetCode(font,word,CodeBuffer);		//从字库中读数据并返回数据长度
			//GetBufferLength	=	GT32L32_GetAntennaCode(3,CodeBuffer);
			//A4=====================写入屏幕
			ST7789V_ShowWord(x,y,font,PenColor,GetBufferLength,CodeBuffer);
			//A5=====================水平显示地址增加
      x+=font;
			i++;		//双字节，减两次			
		}
		else if(('\r'==dst)||('\n'==dst))
		{
			if(('\n'==Buffer[i+1])||('\r'==Buffer[i+1]))
			{
				i++;	//去掉回车符长度
			}
			if(y>MaxV-font)
      {
        y=x=0;
      }
			else
			{
				x=0;
				y+=font;
			}
			goto LCD_ShowJump;
		}
		//B=====================单字节--ASCII字符集
		else
		{			
			//B1=====================显示超限换行
      if(x>MaxH-font/2)//半个宽度
      {
        x=0;
        y+=font;
      }
      //B2=====================显示到屏尾，从原点开始
      if(y>MaxV-font)
      {
        y=x=0;
      }
			if(0x00	!=	(char)dst)
			{
				//B3=====================读取点阵数据
				GetBufferLength	=	GT32L32_GetCode(font,(u16)dst,CodeBuffer);		//从字库中读数据并返回数据长度
				//GetBufferLength	=	GT32L32_GetBatteryCode(3,CodeBuffer);
				//=======================水平制表符按空格显示(部分字库会当0xFF输出)
				if(	('	'	==	(char)dst)		//水平制表符
					||(' '	==	(char)dst))		//空格
				{
					memset(CodeBuffer,0x00,GetBufferLength);
				}
				//B4=====================写入屏幕
				ST7789V_ShowChar(x,y,font,PenColor,GetBufferLength,CodeBuffer);
				//B5=====================水平显示地址增加
				x+=font/2;
			}
      						
		}
		if(UnicodeFlag)
		{
			i+=1;
		}
		LCD_ShowJump:
			__nop();
	}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ST7789V_ShowStringBK(
							u16 x,			//x				:起点x坐标
							u16 y,			//y				:起点y坐标
							u8 font,		//font		:字体大小
							u16 BKColor,
							u16 PenColor,//字体颜色
							u8 num,			//num			:字节数
							u8 *Buffer	//Buffer	:显示的内容缓存
)		//高通字库测试程序
{
	unsigned short	MaxV=ST7789V_V,MaxH=ST7789V_H;	//边界值
	unsigned char i=0;
	unsigned char CodeBuffer[256]={0};
	switch(pST7789V->ST7789VRotate)
	{
		case ST7789V_Rotate_0D:
			MaxV=ST7789V_V;
			MaxH=ST7789V_H;
		break;
		case ST7789V_Rotate_90D:
			MaxV=ST7789V_H;
			MaxH=ST7789V_V;
		break;
		case ST7789V_Rotate_180D:
			MaxV=ST7789V_V;
			MaxH=ST7789V_H;
		break;
		case ST7789V_Rotate_270D:
			MaxV=ST7789V_H;
			MaxH=ST7789V_V;
		break;
		default:break;		
	}
	for(i=0;i<num;i++)
	{
		unsigned char GetBufferLength	=	0;
		unsigned char dst=Buffer[i];
		
		//A=====================双字节--汉字
		if(dst>0x80)
		{
			u16 word=dst<<8;
      
			dst=Buffer[i+1];
			word=word|dst;			
			//A1=====================显示超限换行
      if(x>MaxH-font)
      {
        x=0;
        y+=font;
      }
      //A2=====================显示到屏尾，从原点开始
      if(y>MaxV-font)
      {
        y=x=0;
      }
      //A3=====================读取点阵数据
			GetBufferLength	=	GT32L32_GetCode(font,word,CodeBuffer);		//从字库中读数据并返回数据长度
			//GetBufferLength	=	GT32L32_GetAntennaCode(3,CodeBuffer);
			//A4=====================写入屏幕
			ST7789V_ShowWordBK(x,y,font,BKColor,PenColor,GetBufferLength,CodeBuffer);
			//A5=====================水平显示地址增加
      x+=font;
			i++;		//双字节，减两次			
		}
		else if(('\r'==dst)||('\n'==dst))
		{
			if(('\n'==Buffer[i+1])||('\r'==Buffer[i+1]))
			{
				i++;	//去掉回车符长度
			}
			if(y>MaxV-font)
      {
        y=x=0;
      }
			else
			{
				x=0;
				y+=font;
			}
			goto LCD_ShowJump;
		}
		//B=====================单字节--ASCII字符集
		else
		{			
			//B1=====================显示超限换行
      if(x>MaxH-font/2)//半个宽度
      {
        x=0;
        y+=font;
      }
      //B2=====================显示到屏尾，从原点开始
      if(y>MaxV-font)
      {
        y=x=0;
      }
			if(0x00	!=	(char)dst)
			{
				//B3=====================读取点阵数据
				GetBufferLength	=	GT32L32_GetCode(font,(u16)dst,CodeBuffer);		//从字库中读数据并返回数据长度
				//GetBufferLength	=	GT32L32_GetBatteryCode(3,CodeBuffer);
				//=======================水平制表符按空格显示(部分字库会当0xFF输出)
				if(	('	'	==	(char)dst)		//水平制表符
					||(' '	==	(char)dst))		//空格
				{
					memset(CodeBuffer,0x00,GetBufferLength);
				}
				//B4=====================写入屏幕
				ST7789V_ShowCharBK(x,y,font,BKColor,PenColor,GetBufferLength,CodeBuffer);
				//B5=====================水平显示地址增加
				x+=font/2;
			}
      						
