wegam/STM32F1xWorkSpace/Driver/Components/SCR/ST7789V.C
		}
		LCD_ShowJump:
			__nop();
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void ST7789V_Test(unsigned short Colr)
{
  unsigned short i=0,j=0;
  
  //ST7789V_PowerOn();
  
  ST7789V_Enable();
  
  //ST7789V_WriteCommand(0x2C); 
  
  ST7789V_SetWindowAddress(0,0,239,319);
    
  for(i=0;i<240;i++)
    for(j=0;j<320;j++)
	{
      ST7789V_WriteData(Colr);
			SysTick_DeleyuS(10);				//SysTick延时nmS
	}
  
  //ST7789V_WriteCommand(0x29);
  
//  for(i=0;i<60000;i++)
//    ST7789V_WriteData(0x00); 
//  
//  ST7789V_WriteCommand(0x29); 
  
  ST7789V_Disable();
}
/*******************************************************************************
* 函数名			:	LCD_Reset
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ST7789V_Reset(void)
{
//	ST7789VSet(RST);
//	LCD_DelaymS(5);				//SysTick延时nmS
//	ST7789VCrl(RST);;
//	LCD_DelaymS(5);				//SysTick延时nmS
//	ST7789VSet(RST);
//	LCD_DelaymS(10);				//SysTick延时nmS
}
/*******************************************************************************
* 函数名			:	
* 功能描述		:	 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ST7789V_Enable(void)
{
	ST7789V_DC_HIGH;  //WriteCommand:DC/RS-LOW
  ST7789V_RD_HIGH;  //ReadDisable
  ST7789V_WR_HIGH;  //WriteDisable
  
  ST7789V_CS_LOW;   //SelectLcm
}
/*******************************************************************************
* 函数名			:	
* 功能描述		:	 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ST7789V_Disable(void)
{
  ST7789V_CS_HIGH;  //Disable LCM
  
  ST7789V_DC_HIGH;  //WriteCommand:DC/RS-LOW
  ST7789V_RD_HIGH;  //ReadDisable
  ST7789V_WR_HIGH;  //WriteDisable
}
/*******************************************************************************
* 函数名			:	
* 功能描述		:	
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ST7789V_WriteCommand(unsigned short Command)
{
	ST7789V_DC_LOW;   //WriteCommand:DC/RS-LOW
  
  ST7789V_WR_LOW;   //WriteEnable
  ST7789V_DATABUS_PORT->ODR = Command;
  ST7789V_WR_HIGH;  //Read
  
  ST7789V_DC_HIGH;   //WriteCommand:DC/RS-LOW
}
/*******************************************************************************
* 函数名			:	ST7789V_WriteIndex
* 功能描述		:	写指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ST7789V_WriteData(unsigned	short	Data)
{
  ST7789V_WR_LOW;   //WriteEnable
  ST7789V_DATABUS_PORT->ODR = Data;
  ST7789V_WR_HIGH;  //Read
}
/*******************************************************************************
* 函数名			:	ST7789V_WriteIndex
* 功能描述		:	写指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
unsigned short ST7789V_ReadData(void)
{
	unsigned short Data	=	0;
  ST7789V_DC_HIGH;  //WriteData:DC/RS
  ST7789V_WR_HIGH;  //WriteDisable
  
  ST7789V_RD_LOW;   //ReadEnable
  Data  = ST7789V_DATABUS_PORT->IDR;
  ST7789V_RD_HIGH;  //ReadEnable
	return Data;
}

/*******************************************************************************
* 函数名			:	ST7789V_WriteGRAM
* 功能描述		:	写指定寄存器 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ST7789V_ReadGRAM(unsigned	short* RAM,unsigned long length)
{
//	unsigned	long	i	=	0;
//	ST7789VCrl(CS);	//LCD_CS_LOW;
//	ST7789V_WriteIndex(0X3E);
//	GPIO_Configuration_IPU	(ST7789V_DATABUS_PORT,ST7789V_DATABUS_Pin);			//将GPIO相应管脚配置为上拉输入模式----V20170605
//	for(i=0;i<length;i++)
//	{
//		RAM[i]=ST7789V_ReadData();
//	}
//	ST7789VSet(CS);	//LCD_CS_HIGH;
//	GPIO_Configuration_OPP50	(ST7789V_DATABUS_PORT,ST7789V_DATABUS_Pin);		//将GPIO相应管脚配置为PP(推挽)输出模式，最大速度2MHz----V20170605	
}
/**************************************************************************************************
* [Function] LCD_PowerOff:  关闭LCD 电源
* [No param]
**************************************************************************************************/
void ST7789V_PowerOff( void )
{
	ST7789V_BL_OFF;		//关背光

}
/*******************************************************************************
*函数名		:	Lcd_Init
*功能描述	:	STM32内部温度传感器配置
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void ST7789V_PowerOn(void)
{
  u16 time=2000;
  u16	temp=time;

  ST7789V_Enable();	  //
	//----------------------------------Software Reset-----------------------------------------------//
  //ST7789V_WriteCommand(0x01);  	
  //ST7789V_DelaymS(520); 	   //Delay 120ms 
	//----------------------------------ExitSleep-----------------------------------------------//
  ST7789V_WriteCommand(0x11);           
  ST7789V_DelaymS(120); 	   //Delay 120ms 
  //----------------------------------Display Setting-----------------------------------------------// 
  ST7789V_WriteCommand(0x36); 
  ST7789V_WriteData(0x00);    //ST7789V_WriteData(0x00);   
	
	
  ST7789V_WriteCommand(0x3a); 
  ST7789V_WriteData(0x55); 
  //--------------------------------ST7789V Frame rate setting----------------------------------// 
  ST7789V_WriteCommand(0xb2); 
  ST7789V_WriteData(0x0c); 
  ST7789V_WriteData(0x0c); 
  ST7789V_WriteData(0x00); 
  ST7789V_WriteData(0x33); 
  ST7789V_WriteData(0x33); 
	
  ST7789V_WriteCommand(0xb7); 
  ST7789V_WriteData(0x35);		//VGH=13V, VGL=-10.4V 
  //----------------------------------------------------------------------------------------------------// 
  ST7789V_WriteCommand(0xbb); 
  ST7789V_WriteData(0x19); 
  ST7789V_WriteCommand(0xc0); 
  ST7789V_WriteData(0x2c); 
  ST7789V_WriteCommand(0xc2); 
  ST7789V_WriteData(0x01); 
  ST7789V_WriteCommand(0xc3); 
  ST7789V_WriteData(0x12); 
  ST7789V_WriteCommand(0xc4); 
  ST7789V_WriteData(0x20); 
  ST7789V_WriteCommand(0xc6); 
  ST7789V_WriteData(0x0f); 
  ST7789V_WriteCommand(0xd0); 
  ST7789V_WriteData(0xa4); 
  ST7789V_WriteData(0xa1); 
  //----------------------------------------------------------------------------------------------------// 
  ST7789V_WriteCommand(0xe0);	   //gamma setting 
  ST7789V_WriteData(0xd0); 
  ST7789V_WriteData(0x04); 
  ST7789V_WriteData(0x0d); 
  ST7789V_WriteData(0x11); 
  ST7789V_WriteData(0x13); 
  ST7789V_WriteData(0x2b); 
  ST7789V_WriteData(0x3f); 
  ST7789V_WriteData(0x54); 
  ST7789V_WriteData(0x4c); 
  ST7789V_WriteData(0x18); 
  ST7789V_WriteData(0x0d); 
  ST7789V_WriteData(0x0b); 
  ST7789V_WriteData(0x1f); 
  ST7789V_WriteData(0x23); 
  ST7789V_WriteCommand(0xe1); 
  ST7789V_WriteData(0xd0); 
  ST7789V_WriteData(0x04); 
  ST7789V_WriteData(0x0c); 
  ST7789V_WriteData(0x11); 
  ST7789V_WriteData(0x13); 
  ST7789V_WriteData(0x2c); 
  ST7789V_WriteData(0x3f); 
  ST7789V_WriteData(0x44); 
  ST7789V_WriteData(0x51); 
  ST7789V_WriteData(0x2f); 
  ST7789V_WriteData(0x1f); 
  ST7789V_WriteData(0x1f); 
  ST7789V_WriteData(0x20); 
  ST7789V_WriteData(0x23); 

