wegam/STM32F1xWorkSpace/Driver/Components/SCR/ST7789V.C
  ST7789V_WriteCommand(0x29);	   //display on 
  ST7789V_WriteCommand(0x2c); 

//	ST7789V_EnterSleep();
  ST7789V_Disable();	//LCD_CS_HIGH;
	
	ST7789V_BL_ON;
 
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void ST7789V_EnterSleep(void)
{
  ST7789V_WriteCommand(0x28); // Standby out
  ST7789V_DelaymS(10);
  ST7789V_WriteCommand(0x10); // Display on
  ST7789V_BL_OFF;		//关背光
}


/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void ST7789V_ExitSleep(void)
{
  ST7789V_WriteCommand(0x11); // Standby out
  ST7789V_DelaymS(180);
  ST7789V_WriteCommand(0x29); // Display on
  ST7789V_BL_ON;		//关背光
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void ST7789V_SetWindowAddress(unsigned short xs,unsigned short ys,unsigned short xe,unsigned short ye)
{
  //--------------------设置X
  ST7789V_WriteCommand(0x2A);
  ST7789V_WriteData(xs>>8);
  ST7789V_WriteData(xs&0xFF);
  ST7789V_WriteData(xe>>8);
  ST7789V_WriteData(xe&0xFF);
  
  //--------------------设置Y
  ST7789V_WriteCommand(0x2B);
  ST7789V_WriteData(ys>>8);
  ST7789V_WriteData(ys&0xFF);
  ST7789V_WriteData(ye>>8);
  ST7789V_WriteData(ye&0xFF);
  
	//----------------------------------Display Setting-----------------------------------------------// 
  ST7789V_WriteCommand(0x36); 
  ST7789V_WriteData(pST7789V->ST7789VRotate);    //ST7789V_WriteData(0x00);
	//----------------------------------write_memory_start
  ST7789V_WriteCommand(ST7789V_R2C_WMS);	  
}
//
//--------------------------------------------------------------GUI
//
/*******************************************************************************
*函数名			:	LCD_DrawPoint
*功能描述		:	画点
*输入				: 
*返回值			:	无
*******************************************************************************/
void ST7789V_DrawDot(
									unsigned short HSX,			//点X坐标*/
									unsigned short HSY,			//点Y坐标*/
									unsigned short Color		//点颜色*/	
								)
{
  ST7789V_Enable();	//LCD_CS_LOW;
	ST7789V_SetWindowAddress(HSX,HSY,HSX,HSY);	//设置光标位置
	ST7789V_WriteData(Color);
  ST7789V_Disable();	//LCD_CS_HIGH;
}
/*******************************************************************************
*函数名		:	LCD_DrawLine
*功能描述	:	画线
*输入			: x1,y1:起点坐标
						x2,y2:终点坐标
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void ST7789V_DrawLine(
									unsigned short HSX, unsigned short HSY, 	//x1,y1:起点坐标
									unsigned short HEX, unsigned short HEY,		//x2,y2:终点坐标
									unsigned short Color					//颜色
)
{
	u16 t; 
	int xerr=0,yerr=0,delta_x,delta_y,distance; 
	int incx,incy,uRow,uCol; 

	delta_x=HEX-HSX; //计算坐标增量 
	delta_y=HEY-HSY; 
	uRow=HSX; 
	uCol=HSY;
	
	if(delta_x>0)
		incx=1; //设置单步方向 
	else if(delta_x==0)
		incx=0;//垂直线 
	else
	{
		incx=-1;
		delta_x=-delta_x;
	}
		
	if(delta_y>0)
		incy=1; 
	else if(delta_y==0)
		incy=0;//水平线 
	else
		{incy=-1;delta_y=-delta_y;}
		
	if( delta_x>delta_y)
		distance=delta_x; 								//选取基本增量坐标轴 
	else
		distance=delta_y;
  
	ST7789V_Enable();	//LCD_CS_LOW;
	for(t=0;t<distance+1;t++ )					//画线输出 
	{  
    ST7789V_SetWindowAddress(uRow,uCol,uRow,uCol);	//设置光标位置
    ST7789V_WriteData(Color);
    
		xerr+=delta_x ; 
		yerr+=delta_y ; 
		if(xerr>distance) 
		{ 
			xerr-=distance; 
			uRow+=incx; 
		} 
		if(yerr>distance) 
		{ 
			yerr-=distance;
			uCol+=incy; 
		} 
	}
  ST7789V_Disable();	//LCD_CS_HIGH;
}
/**************************************************************************************************
* [Function] LCD_DrawCircle:  函数功能、注意事项等的描述
* [param01]t_Point point: description
* [param02]u16 R: description
* [param03]uint8_t Filled: description
* [param04]u16 color: description
**************************************************************************************************/
void ST7789V_DrawCircle(
												u16 x,u16 y,		//圆心坐标原点
												u16 r,					//半径
												u8 Filled,			//是否填充
												u16 color				//颜色
												)
{
	int a,b;
	int di;
	a=0;b=r;	  
	di=3-(r<<1);             //判断下个点位置的标志
	while(a<=b)
	{
		if(Filled)	//填充就画线
		{
			ST7789V_DrawLine(x,y,x-b,y-a,color);             //3           
			ST7789V_DrawLine(x,y,x+b,y-a,color);             //0           
			ST7789V_DrawLine(x,y,x-a,y+b,color);             //1       
			ST7789V_DrawLine(x,y,x-b,y-a,color);             //7           
			ST7789V_DrawLine(x,y,x-a,y-b,color);             //2             
			ST7789V_DrawLine(x,y,x+b,y+a,color);             //4               
			ST7789V_DrawLine(x,y,x+a,y-b,color);             //5
			ST7789V_DrawLine(x,y,x+a,y+b,color);             //6 
			ST7789V_DrawLine(x,y,x-b,y+a,color);             
			a++;
			//使用Bresenham算法画圆     
			if(di<0)
				di +=4*a+6;	  
			else
			{
				di+=10+4*(a-b);   
				b--;
			}
			ST7789V_DrawLine(x,y,x+a,y+b,color);				//AB 两个坐标画一条直线
		}
		else
		{
			ST7789V_DrawDot(x-b,y-a,color);             //3           
			ST7789V_DrawDot(x+b,y-a,color);             //0           
			ST7789V_DrawDot(x-a,y+b,color);             //1       
			ST7789V_DrawDot(x-b,y-a,color);             //7           
			ST7789V_DrawDot(x-a,y-b,color);             //2             
			ST7789V_DrawDot(x+b,y+a,color);             //4               
			ST7789V_DrawDot(x+a,y-b,color);             //5
			ST7789V_DrawDot(x+a,y+b,color);             //6 
			ST7789V_DrawDot(x-b,y+a,color);             
			a++;
			//使用Bresenham算法画圆     
			if(di<0)
				di +=4*a+6;	  
			else
			{
				di+=10+4*(a-b);   
				b--;
			}
				ST7789V_DrawDot(x+a,y+b,color);
		}
	}
}
/**************************************************************************************************
* [Function] LCD_DrawRectangle:  画一下矩形框
* [param01]t_Point top_p: 顶点坐标值
* [param02]t_Point botton_p : 地板坐标值
**************************************************************************************************/
void ST7789V_DrawRectangle(u16 x1,u16 y1,u16 x2,u16 y2,u16 color)
{
	ST7789V_DrawLine( x1, y1,	x1,	y2, color );
	ST7789V_DrawLine( x1, y1,	x2,	y1, color );
	ST7789V_DrawLine( x2, y1,	x2,	y2, color );
	ST7789V_DrawLine( x1, y2,	x2,	y2, color );
}
/*******************************************************************************
*函数名			:	ILI9326_Fill
*功能描述		:	在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
*输入				: 
*返回值			:	无
*******************************************************************************/
void ST7789V_Fill(
							unsigned short xs, unsigned short ys, 	//x1,y1:起点坐标
							unsigned short xe, unsigned short ye,		//x2,y2:终点坐标
							u16 Color
)
{          
	unsigned int x;
	unsigned int y;	
  ST7789V_Enable();	//LCD_CS_LOW;
	ST7789V_SetWindowAddress(xs,ys,xe,ye);
	for(x=0;x<=xe-xs;x++)
	{
		for(y=0;y<=ye-ys;y++)
		{
			ST7789V_WriteData(Color);							//写数据
		}
	}
  ST7789V_Disable();	//LCD_CS_HIGH;
}
/*******************************************************************************
* 函数名			:	ILI9326_Clean
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void ST7789V_Clean(u16 Color)	//清除屏幕函数
{
	unsigned short x,y;
	unsigned short HSX=0,HEX=0,VSY=0,VEY=0,MaxH=0,MaxV=0;
//	unsigned long	length	=	0;
	switch(pST7789V->ST7789VRotate)
	{
		case ST7789V_Rotate_0D:
			HEX=ST7789V_H;
			VEY=ST7789V_V;
		break;
		case ST7789V_Rotate_90D:
			HEX=ST7789V_V;
			VEY=ST7789V_H;
		break;
		case ST7789V_Rotate_180D:
			HEX=ST7789V_H;
			VEY=ST7789V_V;
		break;
		case ST7789V_Rotate_270D:
			HEX=ST7789V_V;
			VEY=ST7789V_H;
		break;
		default:break;
		
