wegam/STM32F1xWorkSpace/Driver/Components/SCR/ST7789V.C
)		//高通字库测试程序
{
	u8 temp;
	u8 i=0,j=0;
	unsigned short x1=0,x2=0,y1=0,y2=0;
	unsigned short LCD_PEN_COLOR	=	0;   	//画笔色
	x1	=	x;
	y1	=	y;
  x2	=	x+font-1;
  y2	=	y+font-1;
  
  ST7789V_Enable();	//LCD_CS_LOW;
	ST7789V_SetWindowAddress(x1,y1,x2,y2);//设置显示区域

	for(i=0;i<num;i++)
	{ 
		temp=Buffer[i];		 				
		for(j=0;j<8;j++)
		{
			if((temp&0x80)==0X80)
			{
				LCD_PEN_COLOR=PenColor;
			}
			else
				LCD_PEN_COLOR=BKColor;
			ST7789V_WriteData(LCD_PEN_COLOR);
			temp=temp<<1;
			
		}
    //=======================未满8位的补充定入
    if((12==font))
    {
      temp=Buffer[i+1];		 					
      for(j=0;j<4;j++)
      {
        if((temp&0x80)==0X80)
        {
          LCD_PEN_COLOR=PenColor;
        }
        else
          LCD_PEN_COLOR=BKColor	;
        ST7789V_WriteData(LCD_PEN_COLOR);
        temp=temp<<1;
      }
      i++;
    }			
	}
	ST7789V_Disable();	//LCD_CS_HIGH;
}

/*******************************************************************************
* 函数名			:	LCD_DelayuS
* 功能描述		:	延时x微秒
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ST7789V_DelayuS(u32 xuS)
{
	SysTick_DeleyuS(xuS);				//SysTick延时nmS;
}
/*******************************************************************************
* 函数名			:	LCD_DelaymS
* 功能描述		:	延时x毫秒
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ST7789V_DelaymS(u32 xms)
{
	SysTick_DeleymS(xms);				//SysTick延时nmS;
}
/*******************************************************************************
* 函数名			:	LCD_DelayS
* 功能描述		:	延时x秒
* 输入			: void
* 返回值			: void
*******************************************************************************/
void ST7789V_DelayS(u32 xS)
{
	SysTick_DeleyS(xS);				//SysTick延时nmS;
}


